Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_45 (Conv2D)           (None, 26, 26, 32)        320       
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 13, 13, 32)        0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 11, 11, 64)        18496     
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 9, 9, 64)          36928     
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 4, 4, 64)          0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 1024)              0         
_________________________________________________________________
dense_30 (Dense)             (None, 100)               102500    
_________________________________________________________________
dense_31 (Dense)             (None, 3)                 303       
=================================================================
Total params: 158,547
Trainable params: 158,547
Non-trainable params: 0
_________________________________________________________________
